HELYXcore-4.4.0/examples/legacy/electromagnetics/mhdFoam/hartmann/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    line_centreProfile
    {
        type    uniform;
        axis    distance;
        start   (10.001 -1 0.01);
        end     (10.001 1 0.01);
        nPoints 100;
    }
);

fields          ( Ux );


// ************************************************************************* //
